OlegDemk/stm32F103C8_NRF24L01_and_LoRa_E220_900T22D/RX/Core/Src/menu/menu.c
/*
 * oled_simulation_menu.c
 *
 *  Created on: Aug 23, 2021
 *      Author: odemki
 */
#include <menu/menu.h>
#include "main.h"
#include <stdio.h>
#include <stdlib.h>

#include <OLED/fonts.h>
#include <OLED/oled_ssd1306.h>
#include <OLED/ssd1306.h>
#include <OLED/oled_main.h>

#include <LoRa_E220_900T22D/e220_900t22d.h>

#include <NRF24L01/nrf24l01.h>

#include <am2302/am2302.h>

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/*							READ ME
 	  	  Дане меню використовує OLED екран з драйвером ssd1306.  0.96 дюйма 128x64 I2C
      	  Зчитування кнопок:
  	  Дані про натиснуті кнопки беруться з файлу stm32f1xx_it.c.
  	  В файлі stm32f1xx_it.c відбуваються переривання при натисканні будь якої з тьох кнопок.
  	  Після переривання вмикається таймер, яки відрахоувє певний час, який кномпка має бути зажата, щоб
  	  відсіяти дребізг контактів кнопки.

      	  Меню:
      	  Принцип роботи меню:
      1. Створюється структура, в якій елементи структури ссилаються на інші структури.В подальшому
      ці елементи використовуються для того, щоб мати можливість рухатись по чотирьохзаязному списку структур.
      Також в є елементи структури в які буде записується назва елемена, порядковий номер, і такох адреса функці
      для відрисовки графіки на екрані.
      2. Створюється массив таких структур з відповідною кількістю елементів для кожного меню.
      3. Створюється показний на найперший пункт основного меню. Він буде використовуватись як основний показник
      на структуру елемента меню, на якому зараз знаходиться.
      4. В функції Menu_Init відбувається створення показника на функції які будуть вписуватися в поля структур нижще.
      5. Заповнення структур в функції Menu_Init. Заповнюються всі елементи структури відповідно до задачі.
      В заледності від задачі можна додавати або відміняти кількість елементів структури.
      6. Навігація відбувається в функції menu.


      Редагування меню:
  Для додавання нового меню потрібно зробити такі кроки:
  	1. Створити массив з відповідною кількістю елементів структур MenuItem_t імя_нового_пункту[кількість елементі в в ньому];

  	2. Заповнити відповідні поля спасивів структур у функції Menu_Init:
  		Example:
  			items[0].up = 0;											// Адрес елемента меню, на який елемент буде здійснено перехід при натисеанні кнопки UP
			items[0].down = &items[1];									// Адрес елемента меню, на який елемент буде здійснено перехід при натисеанні кнопки Down
			items[0].child = &items_menu_1[0];							// Адрес нульового елемента нового підменю
			items[0].id = 1;											// Порядковий номер елемента меню
			items[0].name = "LoRa E220 RX";								// Назва меню
			items[0].updateScreen_up = p_print_rows_on_oled_if_up;		// Показник на функцію, яка робить навігацію вверх, і відотсовує її на екрані
			items[0].updateScreen_down = p_print_rows_on_oled_if_down;	// Показник на функцію, яка робить навігацію вниз, і відотсовує її на екрані
			items[0].makeAction = 0;									// Показник на функцію, яка робить дію при натисканні на даний пункт меню
	makeAction - не використовується тоді коли є поле child (тобто коли є підменю). Це зроблено для того, щоб сумістити
	дві функції в одній кнопці.

	3. Дописати виконавчу функцію. Потім записати її тут: items[0].makeAction, замість нуля.
 *
 */
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

extern UART_HandleTypeDef huart3;
extern TIM_HandleTypeDef htim2;

//extern struct am3202_sensor;
extern bool ready_to_work;
extern bool error_state;
extern bool am2302_ready;
int measure_counter = 0;		// For am3202
// ----------------------------------------------------------------------------------
// Main struct menu
typedef struct Struct{
	struct Struct* up;							// pointer on up element of list
	struct Struct* down;						// pointer on down element of list
	struct Struct* child;						// Pointer on child menu
	struct Struct* parent;						// Pointer on parent menu

	uint8_t id;									// Number of menu
	char *name;									// Name menu
	void ( *updateScreen_up ) (void );			// Function print graphic on OLED
	void ( *updateScreen_down ) (void );		// Function print graphic on OLED
	void ( *makeAction) ( void );
}MenuItem_t;

// How many menu items in menu
#define MENU_ITEM_NUM 3				// Main menu		(first menu level)
#define MENU_1_ITEM_NUM 3			// LoRa menu 		(second menu level)
#define MENU_1_1_ITEM_NUM 3			// LoRa TX menu		(third menu level)
#define MENU_2_ITEM_NUM 3			// NRF menu			(second menu level)
#define MENU_2_1_ITEM_NUM 3			// NRF TX menu 		(third menu level)
#define MENU_3_ITEM_NUM 4			// Sensor menu		(second menu level)

//#define MENU_4_ITEM_NUM 10

// Create menu item array structure for all menus
MenuItem_t items[MENU_ITEM_NUM];
MenuItem_t items_menu_1[MENU_1_ITEM_NUM];
MenuItem_t items_menu_2[MENU_2_ITEM_NUM];
MenuItem_t items_menu_3[MENU_3_ITEM_NUM];
MenuItem_t items_menu_1_1[MENU_1_1_ITEM_NUM];
MenuItem_t items_menu_2_1[MENU_2_1_ITEM_NUM];
//MenuItem_t items_menu_4[MENU_4_ITEM_NUM];

MenuItem_t * currentItem = &items[0];								// Create and set pointer on first element of list

bool block_interrupt_form_up_and_down_buttons = false;				// Flag for lock interrupt from 'up' and 'down' buttons in some cases
uint8_t button_status = BOTTON_DOESENT_PRESS;						// Pressed button
extern int button_processed_status;									// For interrupt work only one time

char str_pointer[4] = "->";											// How look pointer on menu item

// OLED Rows coordinates
uint16_t first_menu_row = 16;
uint16_t second_menu_row = 28;
uint16_t third_menu_row = 40;
uint16_t fourth_menu_row = 52;
uint8_t row_step = 12;
uint16_t start_print_id_menu_x = 15;
uint16_t start_print_name_menu_x = 30;

// AM2302
extern  uint32_t i; 											// Counter transmitted data
extern int test_data;									  		// Init test data for transmit
extern uint32_t retr_cnt_full;
extern uint32_t cnt_lost;

void scroll_bar(void);
void print_rectangle_on_head(void);
void clear_menu_items (bool first, bool second, bool third, bool fourth);
void print_rows_on_oled_if_up(void);											// print text menu items
void print_rows_on_oled_if_down(void);											// print text menu items
void print_menu_init(void);
void print_menu_items(void);
void return_from_menu(void);
// Don't used functions
void items_menu_1_set_par_1(void);
void items_menu_1_set_par_2(void);
void items_menu_2_set_par_1(void);
void do_it_function_menu_3(void);
//

void lora_tx_mode(void);						// Transmit test data (counter)
void lora_tx_mode_send_T_and_H(void);			// Transmit H and H
void lora_rx_mode(void);						// Receive data from LoRa module
void nrf_tx_mode_send_test_number(void);		// Transmit test data (counter)
void nrf_tx_mode_send_T_and_H(void);			// Transmit H and H
void nrf_rx_mode(void);							// Receive data from NRF module
void am2302(void);								// Measure T and H using TIMER2 (timer will be off if out from this function)
void periodic_measurement_am2302_on(void);		// On Measure T and H using TIMER2 (Use it for TX data by NRF or LoRa)
void periodic_measurement_am2302_off(void);		// OFF Measure T and H using TIMER2

// ----------------------------------------------------------------------------------------
void Menu_Init (void)
{
	// Make pointers on funsctions
	// Main functions
	void (*p_print_rows_on_oled_if_up) (void);
	p_print_rows_on_oled_if_up = print_rows_on_oled_if_up;
	void (*p_print_rows_on_oled_if_down) (void);					// Create pointer on function
	p_print_rows_on_oled_if_down = print_rows_on_oled_if_down;		// Save function print on pointer print_p
	void (*p_return_from_menu)(void);
	p_return_from_menu = return_from_menu;
	// ------------------------------------------------------

	// LoRa  menu functions
	void (*p_lora_rx_mode) (void);						// Function "Do it". Works when select it
	p_lora_rx_mode = lora_rx_mode;
	void (*p_lora_tx_mode) (void);						// Function "Do it". Works when select it
	p_lora_tx_mode = lora_tx_mode;
	void (*p_lora_tx_mode_send_T_and_H) (void);
	p_lora_tx_mode_send_T_and_H = lora_tx_mode_send_T_and_H;


	// ------------------------------------------------------
	// NRF menu functions
	void (*p_nrf_tx_mode_send_test_number) (void);						// Function "Do it". Works when select it
	p_nrf_tx_mode_send_test_number = nrf_tx_mode_send_test_number;
	void (*p_nrf_tx_mode_send_T_and_H) (void);
	p_nrf_tx_mode_send_T_and_H = nrf_tx_mode_send_T_and_H;
	void (*p_nrf_rx_mode) (void);						// Function "Do it". Works when select it
	p_nrf_rx_mode = nrf_rx_mode;

	// ------------------------------------------------------
	// NRF menu functions
	void (*p_am2302_measure) (void);
	p_am2302_measure = am2302;
	// ------------------------------------------------------
	void (*p_periodic_measurement_am2302_on) (void);
	p_periodic_measurement_am2302_on = periodic_measurement_am2302_on;
	// ------------------------------------------------------
	void (*p_periodic_measurement_am2302_off) (void);
	p_periodic_measurement_am2302_off = periodic_measurement_am2302_off;
	// ------------------------------------------------------

//	void (*p_items_menu_1_set_par_2) (void);			// Doesen't use yet
//	p_items_menu_1_set_par_2 = items_menu_1_set_par_2;

	// items_menu_2 menu functions
//	void (*p_do_it_function_menu_2) (void);						// Function "Do it". Works when select it
//	p_do_it_function_menu_2 = do_it_function_menu_2;

//	void (*p_items_menu_2_set_par_1) (void);
//	p_items_menu_2_set_par_1 = items_menu_2_set_par_1;

//	// items_menu_3 menu functions
//	void (*p_do_it_function_menu_3) (void);						// Function "Do it". Works when select it
//	p_do_it_function_menu_3 = do_it_function_menu_3;


	// Fill in elements(nodes) of list (7 items)
	// Main menu items
	/////////////////////////////////////////////////////////////////
	items[0].up = 0;
	items[0].down = &items[1];
	items[0].child = &items_menu_1[0];
	items[0].parent = 0;
	items[0].id = 1;
	items[0].name = "LoRa E220";
	items[0].updateScreen_up = p_print_rows_on_oled_if_up;
	items[0].updateScreen_down = p_print_rows_on_oled_if_down;
	items[0].makeAction = 0;

