OlegDemk/stm32F103C8_NRF24L01_and_LoRa_E220_900T22D/RX/Core/Src/menu/menu.c
	ssd1306_UpdateScreen();
}
// ----------------------------------------------------------------------------------------
void print_rectangle_on_head(void)
{
	ssd1306_DrawRectangle(0, 0, 127 , 15, White);
	ssd1306_UpdateScreen();
}
// ----------------------------------------------------------------------------------------
// Clear some menu items.
void clear_menu_items (bool first, bool second, bool third, bool fourth)
{
	uint8_t start_row_x = 15;
	char str[16] = "               ";   						// Must be 15

	if(first == true)
	{
		ssd1306_SetCursor(start_row_x, first_menu_row);
		ssd1306_WriteString(str,  Font_7x10, White);
	}
	if(second == true)
	{
		ssd1306_SetCursor(start_row_x, second_menu_row);
		ssd1306_WriteString(str,  Font_7x10, White);
	}
	if(first == true)
	{
		ssd1306_SetCursor(start_row_x, third_menu_row);
		ssd1306_WriteString(str,  Font_7x10, White);
	}
	if(fourth == true)
	{
		ssd1306_SetCursor(start_row_x, fourth_menu_row);
		ssd1306_WriteString(str,  Font_7x10, White);
	}
	ssd1306_UpdateScreen();
}
// ----------------------------------------------------------------------------------------
void print_rows_on_oled_if_up(void)								// print text menu items
{
	char str[16] = {0};
	clear_menu_items (true , true , true , true );
	print_rectangle_on_head();
	// Print pointer on first item menu
	ssd1306_SetCursor(0, first_menu_row);
	ssd1306_WriteString(str_pointer,  Font_7x10, White);

	MenuItem_t * currentItem_buff_up = currentItem;				// Create buffer on selected current item pointer.
	for (uint8_t row = first_menu_row; row <= fourth_menu_row; row = row + row_step)
	{
		// Fill in OLED buffer
		// Print number of menu item
		itoa(currentItem_buff_up -> id, str, 10);
		ssd1306_SetCursor(start_print_id_menu_x, row);
		ssd1306_WriteString(str,  Font_7x10, White);

		// Print name of menu item
		strncpy(str, currentItem_buff_up -> name, 15);
		ssd1306_SetCursor(start_print_name_menu_x, row);
		ssd1306_WriteString(str,  Font_7x10, White);

		currentItem_buff_up = currentItem_buff_up -> down;		// Make a step down

		// Print only existing items
		if(currentItem_buff_up == 0)							// If no next item
		{
			break;
		}
	}
	ssd1306_UpdateScreen();
	scroll_bar();
}
// ----------------------------------------------------------------------------------------
void print_rows_on_oled_if_down(void)							// print text menu items
{
	char str[16] = {0};
	clear_menu_items (true , true , true , true );
	print_rectangle_on_head();
	// Print pointer on first item menu
	ssd1306_SetCursor(0, first_menu_row);
	ssd1306_WriteString(str_pointer,  Font_7x10, White);

	MenuItem_t * currentItem_buff = currentItem;				// Create buffer on selected current item pointer.
	for (uint8_t row = first_menu_row; row <= fourth_menu_row; row = row + row_step)
	{
		// Fill in OLED buffer
		// Print number of menu item
        itoa(currentItem_buff -> id, str, 10);
		ssd1306_SetCursor(start_print_id_menu_x, row);
		ssd1306_WriteString(str,  Font_7x10, White);

		// Print name of menu item
		memset(str, 0, sizeof(str));
	    strncpy(str, currentItem_buff -> name, 15);
	    ssd1306_SetCursor(start_print_name_menu_x, row);
	    ssd1306_WriteString(str,  Font_7x10, White);

	    currentItem_buff = currentItem_buff -> down;			// Make a step down

	    // Print only existing items
	    if(currentItem_buff == 0)		 						// If no next item
	    {
	    	break;
	    }
	 }
	 ssd1306_UpdateScreen();
	 scroll_bar();
}
// ----------------------------------------------------------------------------------------
// Print first 4 items of menu (only first time)
void print_menu_init(void)
{
	MenuItem_t * currentItem_buff = currentItem;		// Create buffer on selected current item pointer.
	print_rectangle_on_head();

	// Print ">> MAIN MENU <<" on head of OLED
	char str[20] = ">> MAIN MENU <<";
	ssd1306_SetCursor(10, 3);
	ssd1306_WriteString(str,  Font_7x10, White);
	ssd1306_UpdateScreen();
	memset(str, 0, sizeof(str));

	for(uint8_t row = first_menu_row; row <= fourth_menu_row; row = row + row_step)
	{
		if(row == first_menu_row)
		{
			// Print pointer on menu (On top)
			char str_pointer[4] = "->";
			ssd1306_SetCursor(0, row);
			ssd1306_WriteString(str_pointer,  Font_7x10, White);
		}
		// Print number of menu item
		itoa(currentItem_buff -> id, str, 10);
		ssd1306_SetCursor(start_print_id_menu_x, row);
		ssd1306_WriteString(str,  Font_7x10, White);
		memset(str, 0, sizeof(str));

		// Print menu of menu item
		strncpy(str, currentItem_buff -> name, 15);
		ssd1306_SetCursor(start_print_name_menu_x, row);
		ssd1306_WriteString(str,  Font_7x10, White);

		ssd1306_UpdateScreen();

		currentItem_buff = currentItem_buff -> down;
		if(currentItem_buff == 0)
		{
			break;
		}
	}
	scroll_bar();
}
// ----------------------------------------------------------------------------------------
// print pointers of menu
void print_menu_items(void)
{
	char str[16] = {0};
	clearn_oled();
	print_rectangle_on_head();

	//Print selected name of menu on top of OLED (in rectangle)
	MenuItem_t * currentItem_buff_parent = currentItem;
	currentItem_buff_parent = currentItem_buff_parent -> parent;

	strncpy(str, currentItem_buff_parent -> name, 15);
	ssd1306_SetCursor(10, 3);
	ssd1306_WriteString(str,  Font_7x10, White);
	ssd1306_UpdateScreen();
	memset(str, 0, sizeof(str));

	MenuItem_t * currentItem_buff = currentItem;

	for (uint8_t row = first_menu_row; row <= fourth_menu_row; row = row + row_step)
	{
		if(row == first_menu_row)
		{
			// Print pointer on menu
			char str_pointer[4] = "->";
			ssd1306_SetCursor(0, row);
			ssd1306_WriteString(str_pointer,  Font_7x10, White);
		}
		// Print number of menu item
		itoa(currentItem_buff -> id, str, 10);
		ssd1306_SetCursor(start_print_id_menu_x, row);
		ssd1306_WriteString(str,  Font_7x10, White);

		// Print menu of menu item
		strncpy(str, currentItem_buff -> name, 15);
		ssd1306_SetCursor(start_print_name_menu_x, row);
		ssd1306_WriteString(str,  Font_7x10, White);
		ssd1306_UpdateScreen();

		currentItem_buff = currentItem_buff -> down;
		if(currentItem_buff == 0)
		{
			break;
		}
	}
	scroll_bar();
}
// ----------------------------------------------------------------------------------------
void return_from_menu(void)
{
	currentItem = &items[0];											// Jump to main menu
	clearn_oled();

	// Print "MAIN MENU:"
	char str[20] = ">> MAIN MENU <<";
	ssd1306_SetCursor(10, 3);
	ssd1306_WriteString(str,  Font_7x10, White);
	ssd1306_UpdateScreen();

	print_menu_init();													// Print all start menu
}
// ----------------------------------------------------------------------------------------

////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////
// LORA FUNCTIONS
void lora_rx_mode(void)
{
	clearn_oled();
	print_rectangle_on_head();

