OlegDemk/stm32F103C8_NRF24L01_and_LoRa_E220_900T22D/RX/Core/Src/menu/menu.c
	// Print selected name of menu
	char str[16] = {0};
	strncpy(str, currentItem -> name, 15);
	ssd1306_SetCursor(10, 3);
	ssd1306_WriteString(str,  Font_7x10, White);
	ssd1306_UpdateScreen();
	memset(str, 0, sizeof(str));

	button_status = BOTTON_DOESENT_PRESS;
	block_interrupt_form_up_and_down_buttons = true;
	// waiting for press enter(SW2) button
	do{
		LoRa_RX(true);
	}while (button_status != BUTTON_ENTER);
	LoRa_RX(false);

	block_interrupt_form_up_and_down_buttons = false;

	// Return to first item of current menu
	currentItem = &items_menu_1[0];										// Set global pointer on first menu
	print_menu_items();													// Print items on OLED
}
// ----------------------------------------------------------------------------------------
void lora_tx_mode(void)
{
	clearn_oled();
	print_rectangle_on_head();

	// Print selected name of menu
	char str[16] = {0};
	strncpy(str, currentItem -> name, 15);
	ssd1306_SetCursor(10, 3);
	ssd1306_WriteString(str,  Font_7x10, White);
	ssd1306_UpdateScreen();
	memset(str, 0, sizeof(str));


	button_status = BOTTON_DOESENT_PRESS;
	block_interrupt_form_up_and_down_buttons = true;
	// waiting for press enter(SW2) button
	do{
		LoRa_TX_send_test_number(true);

	}while (button_status != BUTTON_ENTER);
	LoRa_TX_send_test_number(false);

	block_interrupt_form_up_and_down_buttons = false;

	// Return to first item of current menu
	currentItem = &items_menu_1[0];										// Set global pointer on first menu
	print_menu_items();													// Print items on OLED
}
// ----------------------------------------------------------------------------------------
void lora_tx_mode_send_T_and_H(void)
{
	clearn_oled();
	print_rectangle_on_head();

	// Print selected name of menu
	char str[16] = {0};
	strncpy(str, currentItem -> name, 15);
	ssd1306_SetCursor(10, 3);
	ssd1306_WriteString(str,  Font_7x10, White);
	ssd1306_UpdateScreen();
	memset(str, 0, sizeof(str));

	button_status = BOTTON_DOESENT_PRESS;
	block_interrupt_form_up_and_down_buttons = true;
	// waiting for press enter(SW2) button
	do{
		LoRa_TX_send_T_and_H(true);

	}while (button_status != BUTTON_ENTER);
	LoRa_TX_send_T_and_H(false);

	block_interrupt_form_up_and_down_buttons = false;

	// Return to first item of current menu
	currentItem = &items_menu_1[0];										// Set global pointer on first menu
	print_menu_items();													// Print items on OLED
}
// ----------------------------------------------------------------------------------------
////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////
// NRF FUNCTIONS
void nrf_rx_mode(void)
{
	clearn_oled();
	NRF24_init_RX_mode();
	print_rectangle_on_head();

	// Print selected name of menu
	char str[16] = {0};
	strncpy(str, currentItem -> name, 15);
	ssd1306_SetCursor(10, 3);
	ssd1306_WriteString(str,  Font_7x10, White);
	ssd1306_UpdateScreen();
	memset(str, 0, sizeof(str));

	button_status = BOTTON_DOESENT_PRESS;
	block_interrupt_form_up_and_down_buttons = true;
	// waiting for press enter(SW2) button
	do{
		NRF24L01_Receive();
	}while (button_status != BUTTON_ENTER);

	NRF24_WriteReg(CONFIG, 0x00); 										// STOP work with nrf module  (Power off)
	HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);				// Turn off GREEN LED
	block_interrupt_form_up_and_down_buttons = false;
	// Return to first item of current menu
	currentItem = &items_menu_2[0];										// Set global pointer on first menu
	print_menu_items();													// Print items on OLED

	int g = 99;		// For debug
	g = 999 + 10;
}
// ----------------------------------------------------------------------------------------
void nrf_tx_mode_send_test_number(void)
{
	clearn_oled();
	NRF24_init_TX_mode();
	print_rectangle_on_head();

	// Print selected name of menu
	char str[16] = {0};
	strncpy(str, currentItem -> name, 15);
	ssd1306_SetCursor(10, 3);
	ssd1306_WriteString(str,  Font_7x10, White);
	ssd1306_UpdateScreen();
	memset(str, 0, sizeof(str));

	button_status = BOTTON_DOESENT_PRESS;
	block_interrupt_form_up_and_down_buttons = true;
	// waiting for press enter(SW2) button
	do{
		NRF24L01_Transmission_counter();
	}while (button_status != BUTTON_ENTER);
	i = 1; 																// Counter transmitted data
	test_data = 0;									  					// Init test data for transmit data
	retr_cnt_full = 0;
	cnt_lost = 0;

	NRF24_WriteReg(CONFIG, 0x00); 										// STOP work with nrf module  (Power off)
	HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);				// Turn off GREEN LED
	block_interrupt_form_up_and_down_buttons = false;
	// Return to first item of current menu
	currentItem = &items_menu_2[0];										// Set global pointer on first menu
	print_menu_items();													// Print items on OLED
}
// ----------------------------------------------------------------------------------------
void nrf_tx_mode_send_T_and_H(void)
{
	clearn_oled();
	NRF24_init_TX_mode();
	print_rectangle_on_head();

	// Print selected name of menu
	char str[16] = {0};
	strncpy(str, currentItem -> name, 15);
	ssd1306_SetCursor(10, 3);
	ssd1306_WriteString(str,  Font_7x10, White);
	ssd1306_UpdateScreen();
	memset(str, 0, sizeof(str));

	button_status = BOTTON_DOESENT_PRESS;
	block_interrupt_form_up_and_down_buttons = true;
	// waiting for press enter(SW2) button
	do{
		NRF24L01_Transmission_t_and_h();
	}while (button_status != BUTTON_ENTER);
	i = 1; 																// Counter transmitted data
	test_data = 0;									  					// Init test data for transmit data
	retr_cnt_full = 0;
	cnt_lost = 0;

	NRF24_WriteReg(CONFIG, 0x00); 										// STOP work with nrf module  (Power off)
	HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);				// Turn off GREEN LED
	block_interrupt_form_up_and_down_buttons = false;
	// Return to first item of current menu
	currentItem = &items_menu_2[0];										// Set global pointer on first menu
	print_menu_items();													// Print items on OLED
}

// ----------------------------------------------------------------------------------------
////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////
// SENSORS FUNCTIONS
// Function uses Tim2 for periodic measuring.
void am2302(void)
{
	HAL_TIM_Base_Start_IT(&htim2);		// For sensor measure
	HAL_Delay(100);
	clearn_oled();
	print_rectangle_on_head();

