OlegDemk/stm32F103C8_NRF24L01_and_LoRa_E220_900T22D/RX/Core/Src/menu/menu.c
	// Print selected name of menu
	char str[16] = {0};
	strncpy(str, currentItem -> name, 15);
	ssd1306_SetCursor(10, 3);
	ssd1306_WriteString(str,  Font_7x10, White);
	ssd1306_UpdateScreen();
	memset(str, 0, sizeof(str));

	button_status = BOTTON_DOESENT_PRESS;
	block_interrupt_form_up_and_down_buttons = true;	// Lock interrupt from UP and DOWN buttons
	measure_counter = 1;
	// waiting for press enter(SW2) button
	do{
		// Print data
		if(am2302_ready == true)						// Flug from interrup tim2
		{
			char str_temperature[10] = {0};
			char str_humidity[10] = {0};
			char str_1[10] = {0};

			// Clear data place on OLED
			memset(str, ' ', sizeof(str));
			ssd1306_SetCursor(10, first_menu_row);
			ssd1306_WriteString(str,  Font_7x10, White);
			ssd1306_UpdateScreen();
			ssd1306_SetCursor(10, second_menu_row);
			ssd1306_WriteString(str,  Font_7x10, White);
			ssd1306_UpdateScreen();
			memset(str, 0, sizeof(str));

			// Print T and H on OLED
			itoa(am3202_sensor.temterature , str, 10);
			strcat(str_temperature, "T = ");
			strcat(str_temperature, str);
			strcat(str_temperature, " C");
			ssd1306_SetCursor(10, first_menu_row);
			ssd1306_WriteString(str_temperature,  Font_7x10, White);
			memset(str, 0,sizeof(str));

			itoa(am3202_sensor.humidity , str, 10);
			strcat(str_humidity, "H = ");
			strcat(str_humidity, str);
			strcat(str_humidity, " %");
			ssd1306_SetCursor(10, second_menu_row);
			ssd1306_WriteString(str_humidity,  Font_7x10, White);

			// Print counter
			memset(str, 0,sizeof(str));
			strcat(str, "Counter: ");
			itoa(measure_counter , str_1, 10);
			strcat(str, str_1);
			ssd1306_SetCursor(10, third_menu_row);
			ssd1306_WriteString(str,  Font_7x10, White);
			ssd1306_UpdateScreen();

			measure_counter++;
			am2302_ready = false;
		}

	}while (button_status != BUTTON_ENTER);
	HAL_TIM_Base_Stop_IT(&htim2);
	HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET); // Turn off LED
	block_interrupt_form_up_and_down_buttons = false;	// Unlock  UP and DOWN buttons interrupt

	am3202_sensor.temterature = 0;
	am3202_sensor.humidity = 0;

	// Return to first item of current menu
	currentItem = &items_menu_3[0];										// Set global pointer on first menu
	print_menu_items();
}
// ----------------------------------------------------------------------------------------
// Function uses Tim2 for periodic measuring.
void periodic_measurement_am2302_on(void)
{
	HAL_TIM_Base_Start_IT(&htim2);		// For sensor measure
	HAL_Delay(100);
	clearn_oled();
	print_rectangle_on_head();

	// Print selected name of menu
	char str[16] = {0};
	strncpy(str, currentItem -> name, 15);
	ssd1306_SetCursor(10, 3);
	ssd1306_WriteString(str,  Font_7x10, White);
	ssd1306_UpdateScreen();
	memset(str, 0, sizeof(str));

	button_status = BOTTON_DOESENT_PRESS;
	block_interrupt_form_up_and_down_buttons = true;
	measure_counter = 1;
	// waiting for press enter(SW2) button
	do{
		// Print data
		if(am2302_ready == true)	// Flug from interrup tim2
		{
			char str_temperature[10] = {0};
			char str_humidity[10] = {0};
			char str_1[10] = {0};

			// Clear data place on OLED
			memset(str, ' ', sizeof(str));
			ssd1306_SetCursor(10, first_menu_row);
			ssd1306_WriteString(str,  Font_7x10, White);
			ssd1306_UpdateScreen();
			ssd1306_SetCursor(10, second_menu_row);
			ssd1306_WriteString(str,  Font_7x10, White);
			ssd1306_UpdateScreen();

			memset(str, 0, sizeof(str));
			// Print T and H on OLED

			itoa(am3202_sensor.temterature , str, 10);
			strcat(str_temperature, "T = ");
			strcat(str_temperature, str);
			strcat(str_temperature, " C");
			ssd1306_SetCursor(10, first_menu_row);
			ssd1306_WriteString(str_temperature,  Font_7x10, White);

			memset(str, 0,sizeof(str));
			itoa(am3202_sensor.humidity , str, 10);
			strcat(str_humidity, "H = ");
			strcat(str_humidity, str);
			strcat(str_humidity, " %");
			ssd1306_SetCursor(10, second_menu_row);
			ssd1306_WriteString(str_humidity,  Font_7x10, White);

			// Print counter
			memset(str, 0,sizeof(str));
			strcat(str, "Counter: ");
			itoa(measure_counter , str_1, 10);
			strcat(str, str_1);
			ssd1306_SetCursor(10, third_menu_row);
			ssd1306_WriteString(str,  Font_7x10, White);
			ssd1306_UpdateScreen();

			measure_counter++;
			am2302_ready = false;
		}

	}while (button_status != BUTTON_ENTER);
	block_interrupt_form_up_and_down_buttons = false;	// Unlock  UP and DOWN buttons interrupt
	// Return to first item of current menu
	currentItem = &items_menu_3[0];										// Set global pointer on first menu
	print_menu_items();
}
// ----------------------------------------------------------------------------------------
// Function turn off Tim2 for periodic measuring.
void periodic_measurement_am2302_off(void)
{
	HAL_TIM_Base_Start_IT(&htim2);		// For sensor measure
	HAL_Delay(100);
	clearn_oled();
	print_rectangle_on_head();

	// Print selected name of menu
	char str[16] = {0};
	strncpy(str, currentItem -> name, 15);
	ssd1306_SetCursor(10, 3);
	ssd1306_WriteString(str,  Font_7x10, White);
	ssd1306_UpdateScreen();
	memset(str, 0, sizeof(str));

	button_status = BOTTON_DOESENT_PRESS;
	block_interrupt_form_up_and_down_buttons = true;
	measure_counter = 1;
	HAL_TIM_Base_Stop_IT(&htim2);
	HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET); // Turn off LED

	ssd1306_SetCursor(10, second_menu_row);
	strcat(str, "STOP measuring");
	ssd1306_WriteString(str,  Font_7x10, White);
	ssd1306_UpdateScreen();
	memset(str, 0, sizeof(str));

	am3202_sensor.temterature = 0;
	am3202_sensor.humidity = 0;

	// waiting for press enter(SW2) button
	do{

	}while (button_status != BUTTON_ENTER);
	block_interrupt_form_up_and_down_buttons = false;	// Unlock  UP and DOWN buttons interrupt

	// Return to first item of current menu
	currentItem = &items_menu_3[0];										// Set global pointer on first menu
	print_menu_items();

}







// ----------------------------------------------------------------------------------------
void items_menu_1_set_par_1(void)
{
	clearn_oled();

	// Print selected name of menu
	char str[16] = {0};
	strncpy(str, currentItem -> name, 15);
	ssd1306_SetCursor(10, 3);
	ssd1306_WriteString(str,  Font_7x10, White);
	ssd1306_UpdateScreen();
	memset(str, 0, sizeof(str));

	strncpy(str, "Set parameter 1", sizeof(str));
	ssd1306_SetCursor(0, first_menu_row);
	ssd1306_WriteString(str,  Font_7x10, White);
	ssd1306_UpdateScreen();

	button_status = BOTTON_DOESENT_PRESS;
	block_interrupt_form_up_and_down_buttons = true;
	do{
		// Doing settings <<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<

